backend/app/controllers/comments_controller.rb

SELECT "userjmods".* FROM "userjmods" WHERE "userjmods"."user_id" = $1 AND "userjmods"."jmod_id" = $2 LIMIT $3  [["user_id", 1], ["jmod_id", 1], ["LIMIT", 1]]
INSERT INTO "usercomments" ("user_id", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", "1"], ["comment_id", "1"], ["created_at", "2021-03-04 22:15:59.264970"], ["updated_at", "2021-03-04 22:15:59.264970"]]
SELECT "comments".* FROM "comments" WHERE "comments"."body" = $1 AND "comments"."url" = $2 AND "comments"."jmod_id" = $3 LIMIT $4
INSERT INTO "comments" ("body", "url", "jmod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "usercomments".* FROM "usercomments" WHERE "usercomments"."user_id" = $1 AND "usercomments"."comment_id" = $2 LIMIT $3  [["user_id", "1"], ["comment_id", "1"], ["LIMIT", 1]]
---
    def create
        #check if there is an existing Userjmod
        #if there is, cool beans.
        #if there isn't, create one.
        #check if comment currently exists.
        #if it does, check if Usercomment exists. If it does, return error. If it doesn't, create new Usercomment.
        #if it doesn't, create comment then create new Usercomment.
        user = current_user.id
        byebugoa
        jmod = Jmod.find_by(name: params[:jmod])
         if Userjmod.find_by(user_id: user, jmod_id: jmod.id) == nil
            Userjmod.create(user_id: user, jmod_id: jmod.id)
         end

        Comment.find_by(body: params[:body], permalink: params[:permalink], jmod_id: jmod.id) ?
            (comment = Comment.find_by(body: params[:body], url: params[:url], jmod_id: jmod.id)
            Usercomment.find_by(user_id: user, comment_id: comment.id) ?
                response = {error: 'pin exists'} :
                Usercomment.create(user_id: user, comment_id: comment.id) && response = {success: "Pin created"}) :
           (comment = Comment.create(body: params[:body], permalink: params[:permalink], jmod_id: jmod.id)
            Usercomment.create(user_id: user, comment_id: comment.id) && response = {success: "Pin created"})

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        #for presentation, just destroy comment.
        #after graduation, change so it just destroys Usercomment.

        comment = Comment.find_by(id: params["id"])