backend/app/controllers/jmods_controller.rb

    def index
        jmods = Jmod.all
---
SELECT "jmods".* FROM "jmods"

    def create
        jmod = Jmod.new(name: params[:name])
        jmod.valid? ?
        jmod = Jmod.create(name: params[:name]) :
        jmod = Jmod.find_by(name: params[:name])
---
INSERT INTO "jmods" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "JagexAsh"], ["created_at", "2021-03-02 18:50:37.884930"], ["updated_at", "2021-03-02 18:50:37.884930"]]
SELECT "jmods".* FROM "jmods" WHERE "jmods"."name" = $1 LIMIT $2  [["name", "JagexAsh"], ["LIMIT", 1]]