backend/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def destroy
        #for presentation, just destroy tweet.
        #after graduation, change so it just destroys Usertweet.

        tweet = Tweet.find_by(id: params["id"])