backend/app/controllers/tweets_controller.rb

SELECT "userjmods".* FROM "userjmods" WHERE "userjmods"."user_id" = $1 AND "userjmods"."jmod_id" = $2 LIMIT $3  [["user_id", 1], ["jmod_id", 1], ["LIMIT", 1]]
INSERT INTO "userjmods" ("user_id", "jmod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["jmod_id", 1], ["created_at", "2021-03-04 21:55:46.072575"], ["updated_at", "2021-03-04 21:55:46.072575"]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."body" = $1 AND "tweets"."url" = $2 AND "tweets"."jmod_id" = $3 LIMIT $4
INSERT INTO "tweets" ("body", "url", "jmod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "usertweets".* FROM "usertweets" WHERE "usertweets"."user_id" = $1 AND "usertweets"."tweet_id" = $2 LIMIT $3  [["user_id", "2"], ["tweet_id", "6"], ["LIMIT", 1]]
INSERT INTO "usertweets" ("user_id", "tweet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", "2"], ["tweet_id", "4"], ["created_at", "2021-03-04 19:55:34.698576"], ["updated_at", "2021-03-04 19:55:34.698576"]]
INSERT INTO "usertweets" ("user_id", "tweet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", "2"], ["tweet_id", "6"], ["created_at", "2021-03-04 21:45:47.836425"], ["updated_at", "2021-03-04 21:45:47.836425"]]
---
    def create
        #check if there is an existing Userjmod
        #if there is, cool beans.
        #if there isn't, create one.
        #check if tweet currently exists.
        #if it does, check if Usertweet exists. If it does, return error. If it doesn't, create new Usertweet.
        #if it doesn't, create tweet then create new Usertweet.
        user = current_user.id
        jmod = params[:jmod_id]
         if Userjmod.find_by(user_id: user, jmod_id: jmod) == nil
            Userjmod.create(user_id: user, jmod_id: jmod)
         end

        Tweet.find_by(body: params[:body], url: params[:url], jmod_id: jmod) ?
            (tweet = Tweet.find_by(body: params[:body], url: params[:url], jmod_id: jmod)
            Usertweet.find_by(user_id: user, tweet_id: tweet.id) ?
                response = {error: 'pin exists'} :
                Usertweet.create(user_id: user, tweet_id: tweet.id) && response = {success: "Pin created"}) :
           (tweet = Tweet.create(body: params[:body], url: params[:url], jmod_id: jmod)
            Usertweet.create(user_id: user, tweet_id: tweet.id) && response = {success: "Pin created"})